package C.C200;

//    员工派遣：二分查找

//  题目描述
//        某公司部门需要派遣员工去国外做项目。
//        现在，代号为x的国家和代号为y的国家分别需要 cntx 名和 cnty 名员工。
//        部门每个员工有一个员工号(1,2,3,...)，工号连续，从1开始。
//        部长派遣员工的规则:
//          规则1:从[1,k]中选择员工派遣出去
//          规则2:编号为x的倍数的员工不能去x国，编号为y的倍数的员工不能去y国。
//    问题:
//        找到最小的k，使得可以将编号在[1,K] 中的员工分配给x国和y国，且满足x国和y国的需求。
//    输入描述
//        四个整数 x，y，cntx，cnty。
//          2≤x<y≤30000
//          x和y一定是质数
//          1≤cntx, cnty< 10^9
//          cntx + cnty≤ 10^9
//    输出描述
//        满足条件的最小的k

public class Q23green {
}
